<template>
    <div class="display-report">
        <div v-if="report[0]">
            <div class="initial-report">
                <h2>У Вас выявлены подозрения на Первичный гипотериоз</h2>
                <h4>Проконсультируйтесь с рекомендованными специалистами предварительно сдав необходимые анализы.</h4>
                <p v-if="!show_results">Ответьте на следующие вопросы чтобы узнать к каким специалистам обратиться! Займет не более 2-х минут.</p>
            </div>
            <div class="secondry-report" v-if="show_results">
                <div class="recommendation">
                    <h2>Рекомендованные анализы:</h2>
                    <p>Перед посещением врача необходимо провести дополнительные анализы, что поможет сэкономить время Вам, и Вашему лечащему врачу.</p>
                        <ul>1. УЗИ щитовидной железы</ul>
                        <ul>2. ЭКГ</ul>
                        <ul>3. ЭхоКГ</ul>
                </div>
                <div class="supplementary">
                    <h2>Дополнительные анализы:</h2>
                    <p>Данные анализы являются дополнительными и дадут вашему врачу лучшую картину понимания вашего состояния. Часто врачи отправляют пациентов на дополнительные анализы после первичного приема. Сдав их заранее Вы сэкономите свое время и финасы.</p>
                        <ul>1. ОАК</ul>
                        <ul>2. ЛПНП</ul>
                </div>
            </div>
        </div>
        <div v-if="report[1]">
            <div class="initial-report">
                <h2>У Вас выявлены подозрения на Субклинический гипотериоз</h2>
                <h4>Проконсультируйтесь с рекомендованными специалистами предварительно сдав необходимые анализы.</h4>
                <p v-if="!show_results">Ответьте на следующие вопросы чтобы узнать к каким специалистам обратиться! Займет не более 2-х минут.</p>
            </div>
            <div class="secondry-report" v-if="show_results">
                <div class="recommendation">
                    <h2>Рекомендованные анализы:</h2>
                    <p>Перед посещением врача необходимо провести дополнительные анализы, что поможет сэкономить время Вам, и Вашему лечащему врачу.</p>
                        <ul>1. УЗИ щитовидной железы</ul>
                </div>
                <div class="supplementary">
                    <h2>Дополнительные анализы:</h2>
                    <p>Данные анализы являются дополнительными и дадут вашему врачу лучшую картину понимания вашего состояния. Часто врачи отправляют пациентов на дополнительные анализы после первичного приема. Сдав их заранее Вы сэкономите свое время и финасы.</p>
                        <ul>1. ОАК</ul>
                </div>
            </div>
        </div>
        <div v-if="report[2]">
            <div class="initial-report">
                <h2>У Вас выявлены подозрения на Центральный гипотериоз</h2>
                <h4>Проконсультируйтесь с рекомендованными специалистами предварительно сдав необходимые анализы.</h4>
                <p v-if="!show_results">Ответьте на следующие вопросы чтобы узнать к каким специалистам обратиться! Займет не более 2-х минут.</p>
            </div>
            <div class="secondry-report" v-if="show_results">
                <div class="recommendation">
                    <h2>Рекомендованные анализы:</h2>
                    <p>Перед посещением врача необходимо провести дополнительные анализы, что поможет сэкономить время Вам, и Вашему лечащему врачу.</p>
                        <ul>1. УЗИ щитовидной железы</ul>
                        <ul>2. ЭКГ</ul>
                        <ul>3. ЭхоКГ</ul>
                        <ul>4. МРТ/КТ гипофеза головного мозга с контрастированием</ul>
                </div>
                <div class="supplementary">
                    <h2>Дополнительные анализы:</h2>
                    <p>Данные анализы являются дополнительными и дадут вашему врачу лучшую картину понимания вашего состояния. Часто врачи отправляют пациентов на дополнительные анализы после первичного приема. Сдав их заранее Вы сэкономите свое время и финасы.</p>
                        <ul>1. ОАК</ul>
                        <ul>2. ЛПНП</ul>
                </div>
            </div>
        </div>
        <div v-if="report[3]">
            <div class="initial-report">
                <h2>Необходима консультация нейрохирурга</h2>
                <h4>Проконсультируйтесь с рекомендованными специалистами предварительно сдав необходимые анализы.</h4>
                <p v-if="!show_results">Ответьте на следующие вопросы чтобы узнать к каким специалистам обратиться! Займет не более 2-х минут.</p>
            </div>
            <div class="secondry-report" v-if="show_results">
                <div class="recommendation">
                    <h2>Рекомендованные анализы:</h2>
                    <p>Перед посещением врача необходимо провести дополнительные анализы, что поможет сэкономить время Вам, и Вашему лечащему врачу.</p>
                        <ul>1. МРТ/КТ гипофеза головного мозга с контрастированием</ul>
                </div>
            </div>
        </div>
        <div v-if="report[4]">
            <div class="initial-report">
                <h2>Возможна погрешность анализов</h2>
                <h4>Необходимо повторно сдать анализ гормонов щитовидной железы</h4>
            </div>
        </div>
        <div v-if="report[5]">
            <div class="initial-report">
                <h2>Ошибка считывания</h2>
                <h4>Разбор вашего анализа недоступен в базе, просим извинения</h4>
            </div>
        </div>
    </div>
</template>
<script setup>
    const props = defineProps({
        report: Boolean,
        show_results: Number
    })
</script>